/**
 * 数据采集
 * ----------------------------------------------------------------------------------------
 * var packets = [{
 *    A1: 4103,                        //行政区划码
 *    A2: 123,                         //终端地址
 *    A3: 0,                           //主站地址和组地址标志
 *    APP: {                           //应用层
 *        AFN: 3,                      //AFN
 *        DU: [{                       //数据单元
 *            pn: 0,                   //pn
 *            DT: [{                    //信息类
 *                Fn: 10,              //Fn
 *                DATA: []             //数据，具体格式参考协议规定，可赋值为各种数据类型
 *            }]
 *        }],
 *        AUX: {                       //附加信息域
 *            PW: 0,                   //消息认证码字段（下行）
 *            EC: 1,                   //事件计数器（上行）
 *            Tp: '2014-10-10 10:10:10'//时间标签
 *        }
 *    }
 * }];
 * ----------------------------------------------------------------------------------------
 */

var tmnl_mgr = require('./tmnl_manager');

exports.handler = function (req, res) {
    var A1 = req.body.A1, A2 = req.body.A2, sid = A1 + '@' + A2, tmnl = tmnl_mgr.get(sid);
};